crates/bsl-metadata/fixtures/extension_metadata/base/Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
  <Document>
    <Properties>
      <Name>Заказ</Name>
    </Properties>
    <ChildObjects>
      <Attribute>
        <Properties>
          <Name>БазовыйРеквизит</Name>
          <Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>20</v8:Length></v8:StringQualifiers></Type>
        </Properties>
      </Attribute>
      <TabularSection>
        <Properties>
          <Name>Товары</Name>
        </Properties>
        <ChildObjects>
          <Attribute>
            <Properties>
              <Name>Номенклатура</Name>
              <Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>50</v8:Length></v8:StringQualifiers></Type>
            </Properties>
          </Attribute>
          <Attribute>
            <Properties>
              <Name>Количество</Name>
              <Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>0</v8:FractionDigits></v8:NumberQualifiers></Type>
            </Properties>
          </Attribute>
        </ChildObjects>
      </TabularSection>
    </ChildObjects>
  </Document>
</MetaDataObject>

crates/bsl-metadata/fixtures/extension_metadata/base/Documents/Заказ/Ext/ObjectModule.bsl
Процедура ПроверитьБазу()
    БазовыйРеквизит = "база";
    Для каждого Строка Из Товары Цикл
        Строка.Номенклатура = "товар";
        Строка.Количество = 1;
        Строка.РасшПоле = "недоступно";
        Строка.НетТакогоВЦикле = 1;
    КонецЦикла;

    Документ = Документы.Заказ.СоздатьДокумент();
    КонтрольнаяСтрока = Документ.Товары.Добавить();
    КонтрольнаяСтрока.Номенклатура = "товар";
    КонтрольнаяСтрока.Количество = 1;
    КонтрольнаяСтрока.РасшПоле = "недоступно";
    КонтрольнаяСтрока.НетТакогоПослеДобавить = 1;

    Запрос = Новый Запрос("ВЫБРАТЬ Т.Номенклатура, Т.Количество, Т.РасшПоле, Т.НетТакогоВЗапросе ИЗ Документ.Заказ.Товары КАК Т");
КонецПроцедуры
